# RebarHandlesData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHandlesData Class
Members See Also
---
This class is used to contain the information about the rebar handles defined by an external application.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class RebarHandlesData : IDisposable
```

Visual Basic
---
```text
Public Class RebarHandlesData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RebarHandlesData : IDisposable
```

# Remarks
All handle tags (custom, start, end) should have different values.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarHandlesData
# See Also
RebarHandlesData Members
Autodesk.Revit.DB.Structure Namespace